app/Http/Controllers/Auth/LoginController.php

    public function login(Request $request)
    {
        // Validate the login request
        $request->validate([
            'email' => 'required|string',
            'password' => 'required|string',
            'code' => 'nullable|string',
        ]);

        $loginField = $this->username();

        // maintainence mode is roles not allowes to access the site [ school admin, teacher ] only super admin allowed
        $data = DB::connection('mysql')->table('system_settings')->get();
---
select * from `system_settings`

                    return back()->withErrors(['email' => 'The provided credentials do not match our records.']);
                }

                $data = DB::table('users')
                    ->where(function ($query) use ($request) {
                        $query->where('email', $request->email)
                            ->orWhere('mobile', $request->email); // assuming input field is "email" (can be mobile too)
                    })
                    ->first();
---
select * from `users` where (`email` = 'zippyfin@gmail.com' or `mobile` = 'zippyfin@gmail.com') limit 1