app/Services/CachingService.php

select * from `form_fields` where `form_fields`.`deleted_at` is null order by `rank` asc
---
    public function getSchoolExtraFields() {
        return $this->systemLevelCaching(config('constants.CACHE.SYSTEM.SCHOOL_CUSTOM_FORM_FIELDS'), function () {
            return FormField::orderBy('rank')->get();

select * from `guidances`
---
    public function getGuidances() {
        return $this->systemLevelCaching(config('constants.CACHE.SYSTEM.GUIDANCES'), function () {
            return Guidance::all();

select * from `faqs` where `school_id` is null
---
    public function getSystemFaqs() {
        return $this->systemLevelCaching(config('constants.CACHE.SYSTEM.FAQS'), function () {
            return Faq::where('school_id', null)->get();