app/Http/Controllers/SystemSettingsController.php

    public function index() {
        ResponseService::noPermissionThenRedirect('system-setting-manage');

        // Clear cache and get fresh settings
        $this->cache->removeSystemCache(config('constants.CACHE.SYSTEM.SETTINGS'));
        $settings = $this->cache->getSystemSettings();

        $getDateFormat = getDateFormat();
        $getTimezoneList = getTimezoneList();
        $getTimeFormat = getTimeFormat();
        $get_two_factor_verification = User::where('id', Auth::user()->id)->pluck('two_factor_enabled')->toArray()[0] ? 1 : 0;
---
select `two_factor_enabled` from `users` where `id` = 1 and `users`.`deleted_at` is null